# Привести два примера предметной области, для представления которых лучше использовать
# NoSQL-подход. Аргументировать ответ, используя критерии выбора между SQL и NoSQL.

1) В моей голове возник пример с Википедией:
+ масштабируемое хранилище информации
+ прозрачность внесения изменений (добавление новых узлов и связей или их удаление)

2) Веб - аналитика:
+ обеспечение быстрого доступа к данным
+ хранение больших объемов агрегированных даннх

3) социальные сети:
+ иммет сложные отношения между объектами, несмотря на это идёт легкий поик по базе данных
+ требуемая скорость работы и обработки внесенной информации