# Написать программу, заменяющую все буквы “А” в слове, введённом пользователем, на символ “*”.

s = input('Напишите слово, начинающееся на букву "А": ')
print(s.replace("А", "*", 1))

