# Написать программу для расчёта периметра прямоугольника по введённым длине и ширине.

long = input("Введите длинну: ")
width = input("Введите ширину: ")
sguare = (int(long) + int(width)) * 2
print(sguare)