# Написать программу для расчёта периметра прямоугольника по введённым длине и ширине.
a = int(input('Введите длину прямоугольника: '))
b = int(input('Введите ширину прямоугольника: '))
p = 2 * (a + b)
print(f'Периметр прямоугольника равен: {p}')